jpnorair/OpenTag/include/platform/hw/CC13xx_config.h
/*  Copyright 2008-2022, JP Norair
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  *
  * 2. Redistributions in binary form must reproduce the above copyright 
  *    notice, this list of conditions and the following disclaimer in the 
  *    documentation and/or other materials provided with the distribution.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE 
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE 
  * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE 
  * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR 
  * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF 
  * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS 
  * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN 
  * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
  * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE 
  * POSSIBILITY OF SUCH DAMAGE.
  */
/**
  * @file       /include/platform/hw/CC13xx_config.h
  * @author     JP Norair
  * @version    R102
  * @date       14 Oct 2016
  * @brief      Platform Library Macros and Functions for CC13xx
  * @ingroup    Platform
  *
  ******************************************************************************
  */
  

#ifndef __PLATFORM_CC13xx_CONFIG_H
#define __PLATFORM_CC13xx_CONFIG_H

#include <otstd.h>

//Stored in App Code folder
#include <app/board_config.h>
#include <app/isr_config_CC13xx.h>




/** Long Chip-Select Section <BR>
  * ========================================================================<BR>
  * In your project gcc defines or in the board config file you should set the
  * part number for the MCU on the board.  The preprocessing below will set up
  * other attributes based on the part number.
  */

#define __CC13xx__

#ifndef CORTEX_M3
#   define CORTEX_M3
#endif
#ifndef CC13XX
#   define CC13XX
#endif
#ifndef CC13XX_CC26XX
#   define CC13XX_CC26XX
#endif

// 4x4mm 32-Pin CC13xxFxxRSM devices have 10 GPIOs
#if (   defined(__CC1310F32RSM__) \
    ||  defined(__CC1310F64RSM__) \
    ||  defined(__CC1310F128RSM__) )
#   define MCU_PARAM_GPIO   10

// 5x5mm 32-Pin CC13xxFxxRHB devices have 15 GPIOs
#if (   defined(__CC1310F32RHB__) \
    ||  defined(__CC1310F64RHB__) \
    ||  defined(__CC1310F128RHB__) )
#   define MCU_PARAM_GPIO   15

// 7x7mm 48-Pin CC13xxFxxRGZ devices have 30 GPIOs
#if (   defined(__CC1310F32RGZ__) \
    ||  defined(__CC1310F64RGZ__) \
    ||  defined(__CC1310F128RGZ__) \
    ||  defined(__CC1350F128RGZ__) )
#   define MCU_PARAM_GPIO   30

#else
#   warning "Unknown CC13xx defined.  Defaulting to 10 GPIOs."
#   define MCU_PARAM_GPIO   10
#endif

// CC13xx supports a single port up to 31 pins
#if (MCU_PARAM_GPIO <= 31)
#   define MCU_PARAM_PORTS  1
#else
#   warning "More GPIOs declared than known supported.  Defaulting to 1 Port."
#   define MCU_PARAM_PORTS  1
#endif




// Devices with 32KB FLASH / 16KB SRAM (not including cache)
#if (   defined(__CC1310F32RSM__) \
    ||  defined(__CC1310F32RHB__) \
    ||  defined(__CC1310F32RGZ__) )
#   define SRAM_AVAILABLE    (16*1024)    
#   define EEPROM_AVAILABLE  (0*1024)
#   define FLASH_AVAILABLE   (32*1024)
#   ifndef CC13XXF32
#       define CC13XXF32
#   endif

// Devices with 64KB FLASH / 16KB SRAM (not including cache)
#elif (   defined(__CC1310F64RSM__) \
    ||  defined(__CC1310F64RHB__) \
    ||  defined(__CC1310F64RGZ__) )
#   define SRAM_AVAILABLE    (16*1024)    
#   define EEPROM_AVAILABLE  (0*1024)
#   define FLASH_AVAILABLE   (64*1024)
#   ifndef CC13XXF64
#       define CC13XXF64
#   endif

// Devices with 128KB FLASH / 16KB SRAM (not including cache)
#elif (   defined(__CC1310F128RSM__) \
    ||  defined(__CC1310F128RHB__) \
    ||  defined(__CC1310F128RGZ__) )
#   define SRAM_AVAILABLE    (16*1024)    
#   define EEPROM_AVAILABLE  (0*1024)
#   define FLASH_AVAILABLE   (128*1024)
#   ifndef CC13XXF128
#       define CC13XXF128
#   endif

// Devices with 128KB FLASH / 20KB SRAM (not including cache)
#elif (defined(__CC1350F128RGZ__))
#   define SRAM_AVAILABLE    (20*1024)    
#   define EEPROM_AVAILABLE  (0*1024)
#   define FLASH_AVAILABLE   (128*1024)
#   ifndef CC1350F128
#       define CC1350F128
#   endif

#else
#   warning "Unknown CC13xx defined.  Defaulting to CC1310F128RGZ"
#   define SRAM_AVAILABLE    (16*1024)    
#   define EEPROM_AVAILABLE  (0*1024)
#   define FLASH_AVAILABLE   (128*1024)
#   ifndef CC13XXF128
#       define CC13XXF128
#   endif
#endif






/** Low-Level Library inclusion <BR>
  * ========================================================================<BR>
  * 1. A few CMSIS Cortex M3 Hardware intrinsics that OpenTag uses
  * 2. CC13xxWare driver and low-level support (lots of headers)
  */

// From lib/CMSIS/Include
#include <cm3_endian.h>
#include <cm3_byteswap.h>
#include <cm3_bitrotate.h>
#include <cm3_countleadingzeros.h>
#include <cm3_saturation.h>

// From CC13xxWare directory (it must be added do header search dirs)
#include <inc/asmdefs.h>
#include <inc/hw_adi.h>
#include <inc/hw_adi_0_rf.h>
#include <inc/hw_adi_1_synth.h>
#include <inc/hw_adi_2_refsys.h>
#include <inc/hw_adi_3_refsys.h>
#include <inc/hw_adi_4_aux.h>
#include <inc/hw_aon_batmon.h>
#include <inc/hw_aon_event.h>
#include <inc/hw_aon_ioc.h>
#include <inc/hw_aon_rtc.h>
#include <inc/hw_aon_sysctl.h>
#include <inc/hw_aon_wuc.h>
#include <inc/hw_aux_aiodio.h>
#include <inc/hw_aux_anaif.h>
#include <inc/hw_aux_evctl.h>
#include <inc/hw_aux_sce.h>
#include <inc/hw_aux_smph.h>
#include <inc/hw_aux_tdc.h>
#include <inc/hw_aux_timer.h>
#include <inc/hw_aux_wuc.h>
#include <inc/hw_ccfg.h>
#include <inc/hw_ccfg_simple_struct.h>
#include <inc/hw_chip_def.h>
#include <inc/hw_cpu_dwt.h>
#include <inc/hw_cpu_fpb.h>
#include <inc/hw_cpu_itm.h>
#include <inc/hw_cpu_rom_table.h>
#include <inc/hw_cpu_scs.h>
#include <inc/hw_cpu_tiprop.h>
#include <inc/hw_cpu_tpiu.h>
#include <inc/hw_crypto.h>
#include <inc/hw_ddi.h>
#include <inc/hw_ddi_0_osc.h>
#include <inc/hw_device.h>
#include <inc/hw_event.h>
#include <inc/hw_fcfg1.h>
#include <inc/hw_flash.h>
#include <inc/hw_gpio.h>
#include <inc/hw_gpt.h>
#include <inc/hw_i2c.h>
#include <inc/hw_i2s.h>
#include <inc/hw_ints.h>
#include <inc/hw_ioc.h>
#include <inc/hw_memmap.h>
#include <inc/hw_nvic.h>
#include <inc/hw_prcm.h>
#include <inc/hw_rfc_dbell.h>
#include <inc/hw_rfc_pwr.h>
#include <inc/hw_rfc_rat.h>
#include <inc/hw_smph.h>
#include <inc/hw_ssi.h>
#include <inc/hw_sysctl.h>
#include <inc/hw_trng.h>
#include <inc/hw_types.h>
#include <inc/hw_uart.h>
#include <inc/hw_udma.h>
#include <inc/hw_vims.h>
#include <inc/hw_wdt.h>
#include <driverlib/adi.h>
#include <driverlib/adi_doc.h>
#include <driverlib/aon_batmon.h>
#include <driverlib/aon_event.h>
#include <driverlib/aon_event_doc.h>
#include <driverlib/aon_ioc.h>
#include <driverlib/aon_ioc_doc.h>
#include <driverlib/aon_rtc.h>
#include <driverlib/aon_rtc_doc.h>
#include <driverlib/aon_wuc.h>
#include <driverlib/aux_adc.h>
#include <driverlib/aux_smph.h>
#include <driverlib/aux_tdc.h>
#include <driverlib/aux_timer.h>
#include <driverlib/aux_wuc.h>
#include <driverlib/ccfgread.h>
#include <driverlib/ccfgread_doc.h>
#include <driverlib/chipinfo.h>
#include <driverlib/cpu.h>
#include <driverlib/cpu_doc.h>
#include <driverlib/crypto.h>
#include <driverlib/ddi.h>
#include <driverlib/ddi_doc.h>
#include <driverlib/debug.h>
#include <driverlib/driverlib_release.h>
#include <driverlib/event.h>
#include <driverlib/event_doc.h>
#include <driverlib/flash.h>
#include <driverlib/gpio.h>
#include <driverlib/gpio_doc.h>
#include <driverlib/group_analog_doc.h>
#include <driverlib/group_aon_doc.h>
#include <driverlib/group_aux_doc.h>
#include <driverlib/i2c.h>
#include <driverlib/i2c_doc.h>
#include <driverlib/i2s.h>
#include <driverlib/interrupt.h>
#include <driverlib/interrupt_doc.h>
#include <driverlib/ioc.h>
#include <driverlib/ioc_doc.h>
#include <driverlib/osc.h>
#include <driverlib/prcm.h>
#include <driverlib/pwr_ctrl.h>
#include <driverlib/rf_ble_cmd.h>
#include <driverlib/rf_ble_mailbox.h>
#include <driverlib/rf_common_cmd.h>
#include <driverlib/rf_data_entry.h>
#include <driverlib/rf_hs_cmd.h>
#include <driverlib/rf_hs_mailbox.h>
#include <driverlib/rf_mailbox.h>
#include <driverlib/rf_prop_cmd.h>
#include <driverlib/rf_prop_mailbox.h>
#include <driverlib/rfc.h>
#include <driverlib/rom.h>
#include <driverlib/rom_crypto.h>
#include <driverlib/setup.h>
#include <driverlib/setup_rom.h>
#include <driverlib/smph.h>
#include <driverlib/smph_doc.h>
#include <driverlib/ssi.h>
#include <driverlib/sys_ctrl.h>
#include <driverlib/systick.h>
#include <driverlib/systick_doc.h>
#include <driverlib/timer.h>
#include <driverlib/timer_doc.h>
#include <driverlib/trng.h>
#include <driverlib/uart.h>
#include <driverlib/udma.h>
#include <driverlib/vims.h>
#include <driverlib/watchdog.h>
#include <driverlib/watchdog_doc.h>
#include <rf_patches/rf_patch_cpe_ble.h>
#include <rf_patches/rf_patch_cpe_ble_priv_1_2.h>
#include <rf_patches/rf_patch_cpe_genfsk.h>
#include <rf_patches/rf_patch_cpe_genook.h>
#include <rf_patches/rf_patch_cpe_lrm.h>
#include <rf_patches/rf_patch_mce_genook.h>
#include <rf_patches/rf_patch_mce_hsp_4mbps.h>
#include <rf_patches/rf_patch_rfe_ble.h>
#include <rf_patches/rf_patch_rfe_genfsk.h>
#include <rf_patches/rf_patch_rfe_genook.h>
#include <rf_patches/rf_patch_rfe_hsp_4mbps.h>
#include <rf_patches/rf_patch_rfe_lrm.h>





/** Cryptographic Library Setup      <BR>
  * ========================================================================<BR>
  * Needed to build AES128 or other types of Crypto.  OpenTag has a fully
  * software-based Crypto lib that may be used if no HW is present. However,
  * CC13xx has an internal AES coprocessor with CTR support.
  */
///@todo add library include

  
  

/** Special Platform functions for CC13xx      <BR>
  * ========================================================================<BR>
  * @todo These must be defined before including platform_config.h, so that they
  * can be used for inline functions.
  */
void platform_ext_wakefromstop();
void platform_ext_hsitrim();
ot_u16 platform_ext_lsihz();




/** GPTIM Limiting     <BR>
  * ========================================================================<BR>
  * GPTIM Limit is in TICKS, or units of 1/1024 second.  The CC13xx RTC alarms 
  * allow a 32 bit counter for GPTIM.  The counter has 1/32768 (2^-15) second 
  * resolution and is 32 bits.  Thus the maximum limit is 2^27 ticks, or 2^17
  * seconds = 131072 s = ~36.4 hrs.  Quite a long time.
  *
  * For debugging, it is better to set the limit to a short time in order to 
  * observe timing problems.  For release, it may be as long as feasible.
  */
#ifndef OT_GPTIM_LIMIT
#   if defined(__DEBUG__)
#       define OT_GPTIM_LIMIT   (16 * 1024)
#   else
#       define OT_GPTIM_LIMIT   (131000 * 1024)
#   endif
#endif  




