jpnorair/OpenTag/include/platform/hw/CC13xx_config.h
/** Platform Support settings      <BR>
  * ========================================================================<BR>
  * CC13xx is little endian with 4 byte pointer (32 bits), and at this stage it
  * can be compiled using GCC or TI's ARM compiler
  */

#define PLATFORM(VAL)                   PLATFORM_##VAL
#define PLATFORM_CC13XX
#define PLATFORM_CC13XX_CC26XX

#ifndef __LITTLE_ENDIAN__
#   error "Endian-ness misdefined, should be __LITTLE_ENDIAN__ (check build_config.h)"
#endif
#define PLATFORM_POINTER_SIZE           4               // How many bytes is a pointer?
#define PLATFORM_ENDIAN16(VAR16)        __REV16(VAR16)  // Big-endian to Platform-endian
#define PLATFORM_ENDIAN32(VAR32)        __REV(VAR32)    // Big-endian to Platform-endian
#define PLATFORM_ENDIAN16_C(CONST16)    (ot_u16)( (((ot_u16)CONST16) << 8) | (((ot_u16)CONST16) >> 8) )






/** CC13xx family MCU settings     <BR>
  * ========================================================================<BR>
  * MCU feature settings that are important for OpenTag to know.
  */
#define MCU_FEATURE(VAL)                MCU_FEATURE_##VAL   // FEATURE                  NOTE
#define MCU_FEATURE_SVMONITOR           ENABLED             // Auto Low V powerdown     Low Batt monitor
#define MCU_FEATURE_CRC16               DISABLED            // CRC16                    On RF Core but not MCU
#define MCU_FEATURE_CRC                 MCU_FEATURE_CRC16   // Legacy definition
#define MCU_FEATURE_AES128              ENABLED             // AES128 engine            AES Engine
#define MCU_FEATURE_ECC                 DISABLED            // ECC engine               Not available

#define MCU_TYPE(VAL)                   MCU_TYPE_##VAL
#define MCU_TYPE_PTRINT                 ot_s32
#define MCU_TYPE_PTRUINT                ot_u32

#define MCU_PARAM(VAL)                  MCU_PARAM_##VAL
#define MCU_PARAM_POINTERSIZE           4
#define MCU_PARAM_ERRPTR                ((ot_s32)-1)

// 22bit field: DIVINT is shifted up 6 bits, and DIVFRAC is in the lower 6 bits
// Intended for 24MHz peripheral clock, which is the standard we use on CC13xx.
#define MCU_PARAM_UART_9600BPS          ((156<<6) | (16))
#define MCU_PARAM_UART_28800BPS         ((52<<6) | (5))
#define MCU_PARAM_UART_57600BPS         ((26<<6) | (3))
#define MCU_PARAM_UART_115200BPS        ((13<<6) | (1))
#define MCU_PARAM_UART_250000BPS        ((6<<6) | (0))
#define MCU_PARAM_UART_500000BPS        ((3<<6) | (0))

#define SRAM_START_ADDR                 0x20000000
#define RFRAM_START_ADDR                0x21000000
#define AUXRAM_START_ADDR               0x400E0000
#define FLASH_START_ADDR                0x00000000
#define FLASH_START_PAGE                0
#define FLASH_PAGE_SIZE                 4096
#define FLASH_WORD_BYTES                4
#define FLASH_WORD_BITS                 (FLASH_WORD_BYTES*8)
#define FLASH_PAGE_ADDR(VAL)            (FLASH_START_ADDR + ( (VAL) * FLASH_PAGE_SIZE) )





/** Chip Settings  <BR>
  * ========================================================================<BR>
  * We support GCC and TI ARM compilers.
  */



/* Low Power Mode Macros: (Deprecated)
  * ========================================================================<BR>
  * SLEEP_MCU():        Core off, APB on, SRAM on                       (~50 uA)
  * SLEEP_WHILE_UHF():  Core off, APB on, SRAM on                       (~10 uA)
  * STOP_MCU():         Core off, RTC on, SRAM on                       (~1.5 uA)
  * STANDBY_MCU():      Core off, clocks off, SRAM off                  (~0.2 uA)
  */
//#define MCU_SLEEP               __WFI
//#define MCU_SLEEP_WHILE_IO      __WFI
//#define MCU_SLEEP_WHILE_RF      __WFI
//#define MCU_STOP()              error
//#define MCU_STANDBY()           error





/** Data section Nomenclature  <BR>
  * ========================================================================<BR>
  * We support GCC and TI ARM compilers.
  * Their methods for handling data sections are different enough that two sets
  * of files are needed for startup and filesystem default data placement.
  */




/** Platformized Peripheral Interrupt Handlers <BR>
  * ========================================================================<BR>
  * Use these "platform_isr_...()" functions in your code to service peripheral
  * interrupts.  To use them you must implement them in your code.  OpenTag 
  * implements some of them in its drivers (the ones it needs).  You can see 
  * how they are called from the low-level interrupts in the file:
  * platform/cc13xx_cc26xx/core_isr.c.
  *
  * Some Usage Notes on GPIO interrupts:
  * <li>"platform_isr_gpio()" is a hardware-analogous ISR that will be called
  *     when *any* GPIO that's configured on the MCU (GPIO can be configured to
  *     send interrupt to MCU, AON, or both), has an event.</li>
  * <li>"platform_isr_gpioX()" is a synthetic ISR that will be called when
  *     an event happens on a specific GPIO pin that is tied to MCU</li>
  * <li>"platform_isr_aon()" and "platform_isr_aonrtc()" are both hardware-
  *     analogous interrupts that are used with the "AON event fabric."  
  *     Either can be configured to select GPIO interrupts or actually a bunch
  *     of other systems (see Technical Reference Manual)</li>
  * <li>"platform_isr_aon_...()" ISR functions are synthetic, and they are
  *     called when the AON event hits a configured peripheral</li>
  *
  * Some Usage Notes on DMA interrupts:
  * CC13XX uses the ARM uDMA, which has channels that are for the most part
  * reserved for peripherals.  There are 4 channels for general purpose SW
  * utilization (one of which goes to memcpy).  The DMA interrupts are all
  * synthetic interrupts apart from the global DMA interrupts, which are:
  * "platform_isr_udma()" and "platform_isr_udmaerr()" 
  *
  */

void platform_isr_gpio(void);           //hits if *any* GPIO pin in MCU domain has event
void platform_isr_i2c(void);
void platform_isr_rfccpe1(void);
void platform_isr_aonspi(void);
void platform_isr_aonrtc(void);
void platform_isr_uart0(void);
void platform_isr_auxswevent0(void);
void platform_isr_ssi0(void);
void platform_isr_ssi1(void);
void platform_isr_rfccpe0(void);
void platform_isr_rfchw(void);
void platform_isr_rfccmdack(void);
void platform_isr_i2s(void);
void platform_isr_auxswevent1(void);
void platform_isr_wdog(void);
void platform_isr_tim0a(void);
void platform_isr_tim0b(void);
void platform_isr_tim1a(void);
void platform_isr_tim1b(void);
void platform_isr_tim2a(void);
void platform_isr_tim2b(void);
void platform_isr_tim3a(void);
void platform_isr_tim3b(void);
void platform_isr_crypto(void);
void platform_isr_udmasw(void);
void platform_isr_udmaerr(void);
void platform_isr_flash(void);
void platform_isr_swevent0(void);
void platform_isr_auxcombevent(void);
void platform_isr_aonprog(void);
void platform_isr_dynprog(void);
void platform_isr_auxcompa(void);
void platform_isr_auxadc(void);
void platform_isr_trng(void);


/// Synthetic GPIO interrupts
/// There are two options:
/// 1. gpiox : interrupt occurs when the GPIO is configured in the MCU domain
/// 2. aoniox : interrupt occurs when the GPIO is configured for the AON domain
///
/// If for some reason you have configured a pin for both MCU and AON domains, 
/// both interrupts will occur.
///
void platform_isr_gpio0(void);
void platform_isr_gpio1(void);
void platform_isr_gpio2(void);
void platform_isr_gpio3(void);
void platform_isr_gpio4(void);
void platform_isr_gpio5(void);
void platform_isr_gpio6(void);
void platform_isr_gpio7(void);
void platform_isr_gpio8(void);
void platform_isr_gpio9(void);
#if (MCU_PARAM_GPIO > 10)
void platform_isr_gpio10(void);
void platform_isr_gpio11(void);
void platform_isr_gpio12(void);
void platform_isr_gpio13(void);
void platform_isr_gpio14(void);
#endif
#if (MCU_PARAM_GPIO > 15)
void platform_isr_gpio15(void);
void platform_isr_gpio16(void);
void platform_isr_gpio17(void);
void platform_isr_gpio18(void);
void platform_isr_gpio19(void);
void platform_isr_gpio20(void);
void platform_isr_gpio21(void);
void platform_isr_gpio22(void);
void platform_isr_gpio23(void);
void platform_isr_gpio24(void);
void platform_isr_gpio25(void);
void platform_isr_gpio26(void);
void platform_isr_gpio27(void);
void platform_isr_gpio28(void);
void platform_isr_gpio29(void);
#endif

