jpnorair/OpenTag/include/platform/hw/CC13xx_config.h
/// Synthetic uDMA interrupts
/// Listed in order of descending priority (top is highest)
void platform_isr_udma_sw0(void);
void platform_isr_udma_uart0rx(void);
void platform_isr_udma_uart0tx(void);
void platform_isr_udma_ssp0rx(void);
void platform_isr_udma_ssp0tx(void);
void platform_isr_udma_spisrx(void);
void platform_isr_udma_spistx(void);
void platform_isr_udma_auxadc(void);
void platform_isr_udma_auxsw(void);
void platform_isr_udma_gpt0a(void);
void platform_isr_udma_gpt0b(void);
void platform_isr_udma_gpt1a(void);
void platform_isr_udma_gpt1b(void);
void platform_isr_udma_aonprog2(void);
void platform_isr_udma_dmaprog(void);
void platform_isr_udma_aonrtc(void);
void platform_isr_udma_ssp1rx(void);
void platform_isr_udma_ssp1tx(void);
void platform_isr_udma_sw1(void);
void platform_isr_udma_sw2(void);
void platform_isr_udma_sw3(void);




/** Cortex M3 Universal Interrupts & Handler Functions  <BR>
  * ========================================================================<BR>
  * These interrupts are on all CM3 chips, and we use the STMicro nomenclature
  * because they were first.  The TI nomenclature for their GCC builds is very
  * similar, you can find it in cc13xxware.../startup_files/startup_gcc.c
  *
  * These ISRs are implemented in:
  * - platform/cc13xx_cc26xx/core_errors.c      (Faults, NMI, DebugMon, MemManage)
  * - platform/cc13xx_cc26xx/core_tasking.c     (SVC, PendSV, SysTick)
  *
  * Some are used, others are not.  In particular, OpenTag does not use the
  * SysTick and in fact bars you from using it at all.
  */
void HardFault_Handler(void);
void NMI_Handler(void);
void MemManage_Handler(void);
void BusFault_Handler(void);
void UsageFault_Handler(void);
void SVC_Handler(void);
void DebugMon_Handler(void);
void PendSV_Handler(void);
void SysTick_Handler(void);




/** Cortex M3 NVIC configuration <BR>
  * ========================================================================<BR>
  * Nested Vector Interrupt Controller on the CC13xx has the standard CM3
  * features and registers.  OpenTag likes to use the 2-group NVIC model, one
  * group for the kernel and bios stuff, and one for everything higher level.
  * 4-group model is OK too, but 2-group has much less risk of blowing-up the
  * ISR stack.
  */

#ifndef __CM3_NVIC_GROUPS
#   define __CM3_NVIC_GROUPS    2
#endif

#if (__CM3_NVIC_GROUPS == 1)
#   error "__CM3_NVIC_GROUPS is set to 1, but GULP Kernel not supported on this device."

#elif (__CM3_NVIC_GROUPS == 2)
#   ifndef __KERNEL_HICCULP__
#       define __KERNEL_HICCULP__
#   endif
#   define PLATFORM_NVIC_KERNEL_GROUP   b0000
#   define PLATFORM_NVIC_RF_GROUP       b0100
#   define PLATFORM_NVIC_IO_GROUP       b1000
#   define PLATFORM_NVIC_INT_GROUP      b1000
#   define PLATFORM_NVIC_TASK_GROUP     b1000 

#elif (__CM3_NVIC_GROUPS == 4)
#   ifndef __KERNEL_HICCULP__
#       define __KERNEL_HICCULP__
#   endif
#   define PLATFORM_NVIC_KERNEL_GROUP   b0000
#   define PLATFORM_NVIC_RF_GROUP       b0100
#   define PLATFORM_NVIC_IO_GROUP       b0100
#   define PLATFORM_NVIC_INT_GROUP      b1000
#   define PLATFORM_NVIC_TASK_GROUP     b1100

#elif (__CM3_NVIC_GROUPS == 8)
#   ifndef __KERNEL_HICCULP__
#       define __KERNEL_HICCULP__
#   endif
#   define PLATFORM_NVIC_KERNEL_GROUP   b0000
#   define PLATFORM_NVIC_RF_GROUP       b0010
#   define PLATFORM_NVIC_IO_GROUP       b0100
#   define PLATFORM_NVIC_SLOWIO_GROUP   b0110
#   define PLATFORM_NVIC_INT_GROUP      b1100
#   define PLATFORM_NVIC_TASK_GROUP     b1110

#else
#   error "__CM3_NVIC_GROUPS must be set to 1, 2, 4, or 8"
#endif






/** Default OpenTag Threading and Stack Parameters  <BR>
  * ========================================================================<BR>
  * These are the default parameters for the OpenTag RTOS's handling of stacks.
  * OpenTag has three stacks:
  *
  * P-stack: (P is an ARM CM term) The kernel stack, i.e. the main stack, 
  *          which is usually defined in linker configuration.
  *
  * S-stack: (S is an ARM CM term) Used by ISRs.  OpenTag puts critical I/O 
  *          tasks in the ISRs, such as Radio and MPipe.  512 bytes is found 
  *          to be sufficient with extra room for safety.
  * 
  * T-stack: Total allocation of stack for threads (apps).  This will be 
  *          added to the heap if memory allocation is enabled.  If threads
  *          are disabled, it will be 0.  When OpenTag is configured as a
  *          BIOS for a child OS (e.g. NuttX), this parameter is passed to
  *          the child OS configuration.
  *
  */
#if !defined(OT_PARAM_SYSTHREADS)
#   define OT_PARAM_SYSTHREADS      0
#endif
#if !defined(OT_PARAM_SSTACK_ALLOC)
#   define OT_PARAM_SSTACK_ALLOC    (512)
#elif (OT_PARAM_SSTACK_ALLOC & 3)
#   error "OT_PARAM_SSTACK_ALLOC must be 32-bit aligned."
#endif

#if (OT_PARAM_SYSTHREADS != 0)
#   if !defined(OT_PARAM_TSTACK_ALLOC)
#       define OT_PARAM_TSTACK_ALLOC    (OT_PARAM_SYSTHREADS*160)
#   endif
#   if ((OT_PARAM_TSTACK_ALLOC/OT_PARAM_SYSTHREADS) < 80)
#       error "Specified Thread Stack Size allocates less than 80 bytes per thread stack."
#   endif
#   if (OT_PARAM_TSTACK_ALLOC & 3)
#       error "OT_PARAM_TSTACK_ALLOC must be 32-bit aligned."
#   endif
#endif





/** CC13XX Cryptography Include <BR>
  * ========================================================================<BR>
  * Alias OTEAX Data Type into generic type for OpenTag
  * 
  * @todo there may be some work here to enable CC13XX HW
  */
#if OT_FEATURE(DLL_SECURITY) || OT_FEATURE(NL_SECURITY) || OT_FEATURE(VL_SECURITY)
#   include <oteax.h>
//#   define EAXdrv_t eax_ctx
    typedef eax_ctx EAXdrv_t;
#else
//#   define EAXdrv_t ot_uint
    typedef ot_uint EAXdrv_t;
#endif





/** CC13XX Special Platform Functions & data for timing & clocking <BR>
  * ========================================================================<BR>
  */
#if (OT_FEATURE(TIME) == ENABLED)
#   define RTC_ALARMS   1       // Max=3
#else
#   define RTC_ALARMS   0
#endif

#define GPTIM_FLAG_RTCBYPASS    (1<<1)
#define GPTIM_FLAG_SLEEP        (1<<0)

typedef struct {
    ot_u16  flags;
//#   if defined(__DEBUG__)
//    ot_u16  stamp1;
//    ot_u16  stamp2;
//#   else
    ot_u16  chron_stamp;
    ot_u32  evt_stamp;
    ot_u32  evt_span;
//#   endif
} systim_struct;

typedef struct {
    ot_u8   disabled;
    ot_u8   taskid;
    ot_u16  mask;
    ot_u16  value;
} rtcalarm;

//typedef struct {
//    ot_u32      utc;
//    rtcalarm    alarm[RTC_ALARMS];
//} rtc_struct;


//extern rtc_struct rtc;
extern systim_struct systim;





/** CC13xx Platform Data  <BR>
  * ========================================================================<BR>
  * platform_ext stores data that is required for OpenTag to work properly on
  * the CC13xx.  The data is not platform-independent, but it's pretty similar
  * across ARM CM3's.
  */

typedef struct {
    // Tasking parameters: similar across CM3's
    void*   task_exit;
    
    // Clock speed saves: AHB, APB1, APB2
    ///@todo check if this is necessary on CC13xx
    ot_ulong clock_hz[3];
    
    // LSI kHz divisor, only needed if LSI is actually used
#   if (BOARD_FEATURE_LFXTAL != ENABLED)
    ot_u16 lsi_khz;
    ot_u16 lsi_remhz;
#   endif
    
    // System stack alloctation: used for ISRs
    ot_u32 sstack[OT_PARAM_SSTACK_ALLOC/4];

    // task & thread stacks allocation
#   if (OT_PARAM_SYSTHREADS)
    ot_u32 tstack[OT_PARAM_TSTACK_ALLOC/4];
#   endif
} 
platform_ext_struct;


extern platform_ext_struct  platform_ext;




#endif
